 # 날짜 데이터 처리 변환하기

In [1]:
import pandas as pd
import numpy as np

In [2]:
from datetime import datetime,timedelta

In [3]:
today = datetime.now()

In [4]:
today.day

22

In [5]:
today + timedelta(days = 10)

datetime.datetime(2021, 5, 2, 19, 45, 24, 468411)

In [6]:
today + timedelta(weeks = 3)

datetime.datetime(2021, 5, 13, 19, 45, 24, 468411)

In [7]:
data = pd.DataFrame({'date':['4/20/2021','4/21/2021','4/22/2021'],'value':[10,20,30]})

In [8]:
data

        date  value
0  4/20/2021     10
1  4/21/2021     20
2  4/22/2021     30

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      object
 1   value   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

- date가 object로 되어있다는 것은 date가 string 형태로 저장되어있음

In [10]:
data['date'] = pd.to_datetime(data['date'])

- date 타입 datetime64[ns]으로 바꾸기

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      datetime64[ns]
 1   value   3 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 176.0 bytes

In [12]:
data['date'].loc[0].year

2021

In [13]:
data['date'].loc[0].month

4

In [14]:
data['date'].loc[0].day

20

In [15]:
data = pd.DataFrame({'date':['4-20-2021 9:27:30','4-21-2021 1:33:39','4-22-2021 4:31:23'],'value':[10,20,30]})

In [16]:
data

                date  value
0  4-20-2021 9:27:30     10
1  4-21-2021 1:33:39     20
2  4-22-2021 4:31:23     30

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      object
 1   value   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [18]:
data['date'] = pd.to_datetime(data['date'])

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      datetime64[ns]
 1   value   3 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 176.0 bytes

In [20]:
data['date'].loc[0].second

30

In [21]:
data = pd.DataFrame({'date':['10-11-10','10-11-11','10-11-12'],'value':[10,20,30]})

- https://docs.python.org/3.2/library/time.html

%y	Year without century as a decimal number [00,99].	 
%Y	Year with century as a decimal number.

%m	Month as a decimal number [01,12].	 
%M	Minute as a decimal number [00,59].

In [22]:
pd.to_datetime(data['date'],format = '%y-%m-%d')

0   2010-11-10
1   2010-11-11
2   2010-11-12
Name: date, dtype: datetime64[ns]

In [23]:
data = pd.read_excel('Superstore.xls')

In [24]:
data.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2016-138688,2016-06-12,2016-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

In [25]:
data = data[['Order Date','Ship Date','Sales','Profit']]

In [26]:
data

     Order Date  Ship Date     Sales    Profit
0    2016-11-08 2016-11-11  261.9600   41.9136
1    2016-11-08 2016-11-11  731.9400  219.5820
2    2016-06-12 2016-06-16   14.6200    6.8714
3    2015-10-11 2015-10-18  957.5775 -383.0310
4    2015-10-11 2015-10-18   22.3680    2.5164
...         ...        ...       ...       ...
9989 2014-01-21 2014-01-23   25.2480    4.1028
9990 2017-02-26 2017-03-03   91.9600   15.6332
9991 2017-02-26 2017-03-03  258.5760   19.3932
9992 2017-02-26 2017-03-03   29.6000   13.3200
9993 2017-05-04 2017-05-09  243.1600   72.9480

[9994 rows x 4 columns]

In [27]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Order Date  9994 non-null   datetime64[ns]
 1   Ship Date   9994 non-null   datetime64[ns]
 2   Sales       9994 non-null   float64
 3   Profit      9994 non-null   float64
dtypes: datetime64[ns](2), float64(2)
memory usage: 312.4 KB

- Order Date, Ship Date 둘다 datetime64[ns] 으로 되있어서 변경해줄 필요없음

In [28]:
data['gap'] = data['Ship Date'] - data['Order Date']

In [29]:
data

     Order Date  Ship Date     Sales    Profit    gap
0    2016-11-08 2016-11-11  261.9600   41.9136 3 days
1    2016-11-08 2016-11-11  731.9400  219.5820 3 days
2    2016-06-12 2016-06-16   14.6200    6.8714 4 days
3    2015-10-11 2015-10-18  957.5775 -383.0310 7 days
4    2015-10-11 2015-10-18   22.3680    2.5164 7 days
...         ...        ...       ...       ...    ...
9989 2014-01-21 2014-01-23   25.2480    4.1028 2 days
9990 2017-02-26 2017-03-03   91.9600   15.6332 5 days
9991 2017-02-26 2017-03-03  258.5760   19.3932 5 days
9992 2017-02-26 2017-03-03   29.6000   13.3200 5 days
9993 2017-05-04 2017-05-09  243.1600   72.9480 5 days

[9994 rows x 5 columns]

In [30]:
from sklearn.linear_model import LinearRegression

In [31]:
X = data[['Profit','gap']]
y = data['Sales']

In [32]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Profit  9994 non-null   float64
 1   gap     9994 non-null   timedelta64[ns]
dtypes: float64(1), timedelta64[ns](1)
memory usage: 156.3 KB

In [33]:
X

        Profit    gap
0      41.9136 3 days
1     219.5820 3 days
2       6.8714 4 days
3    -383.0310 7 days
4       2.5164 7 days
...        ...    ...
9989    4.1028 2 days
9990   15.6332 5 days
9991   19.3932 5 days
9992   13.3200 5 days
9993   72.9480 5 days

[9994 rows x 2 columns]

In [34]:
model = LinearRegression()

In [35]:
X['gap'] = X['gap'].apply(lambda x: x.days) #days가 빠진 숫자들만 나온다.

<ipython-input-35-66ccc9bb91cd>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X['gap'] = X['gap'].apply(lambda x: x.days) #days가 빠진 숫자들만 나온다.

In [36]:
X

        Profit  gap
0      41.9136    3
1     219.5820    3
2       6.8714    4
3    -383.0310    7
4       2.5164    7
...        ...  ...
9989    4.1028    2
9990   15.6332    5
9991   19.3932    5
9992   13.3200    5
9993   72.9480    5

[9994 rows x 2 columns]

In [37]:
model.fit(X,y)

LinearRegression()

In [38]:
model.predict(X)

array([248.5051552 , 474.93985046, 202.01637137, ..., 216.14692021,
       208.40675263, 284.40140338])

In [39]:
data = pd.read_excel('Superstore.xls')

In [40]:
data = data[['Order Date','Ship Date','Sales','Profit']]

In [41]:
data

     Order Date  Ship Date     Sales    Profit
0    2016-11-08 2016-11-11  261.9600   41.9136
1    2016-11-08 2016-11-11  731.9400  219.5820
2    2016-06-12 2016-06-16   14.6200    6.8714
3    2015-10-11 2015-10-18  957.5775 -383.0310
4    2015-10-11 2015-10-18   22.3680    2.5164
...         ...        ...       ...       ...
9989 2014-01-21 2014-01-23   25.2480    4.1028
9990 2017-02-26 2017-03-03   91.9600   15.6332
9991 2017-02-26 2017-03-03  258.5760   19.3932
9992 2017-02-26 2017-03-03   29.6000   13.3200
9993 2017-05-04 2017-05-09  243.1600   72.9480

[9994 rows x 4 columns]

In [42]:
pd.to_numeric(data['Order Date']) / 10**9

0       1.478563e+09
1       1.478563e+09
2       1.465690e+09
3       1.444522e+09
4       1.444522e+09
            ...
9989    1.390262e+09
9990    1.488067e+09
9991    1.488067e+09
9992    1.488067e+09
9993    1.493856e+09
Name: Order Date, Length: 9994, dtype: float64

In [43]:
pd.set_option('display.float_format', lambda x: '%.0f' %x)

In [44]:
data['Order Date'] = pd.to_numeric(data['Order Date']) / 10**9
data['Ship Date'] = pd.to_numeric(data['Ship Date']) / 10**9

- Unix Time 으로 변경하기 (초시간대로 변경)

- Unix Time Stamp 사이트에서 날짜 확인 가능 (구글에서 Unix Time Convert 검색)

- Unix Time 장점 
1. days 에 걸림돌이 없다
2. 완전히 깔끔한 유니크한 데이터로 갈수있다.

In [46]:
data['gap'] = data['Ship Date'] - data['Order Date']

In [48]:
X = data[['Profit','gap']]
y = data['Sales']

In [49]:
model = LinearRegression()

model.fit(X,y)

LinearRegression()